case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

  xmin -0.5;
  ymin -0.5;
  zmin -0.5;
  
  xmax 0.5;  
  ymax 0.5;
  zmax 0.5;

vertices
(
($xmin  $ymin  $zmin)
($xmax  $ymin  $zmin)  
($xmax  $ymax  $zmin)  
($xmin  $ymax  $zmin) 
($xmin  $ymin  $zmax)  
($xmax  $ymin  $zmax) 
($xmax  $ymax  $zmax)
($xmin  $ymax  $zmax)
);


blocks
(   
	 hex (0 1 2 3 4 5 6 7) (3 3 1) simpleGrading (1 1 1) 
);


edges
(

);

boundary
(
    top
    {
        type patch;
        faces
        (
            (3 7 6 2)  
        );
    }

    bottom
    {
        type patch;
        faces
        (
            (1 5 4 0)
        );
    }

    frontAndBack
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (2 6 5 1)  
        );
    }

   left
    {
        type patch;
        faces
        (
  	    	(0 3 2 1)
        );
    }

    right
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }





);

mergePatchPairs
(
);

// ************************************************************************* //
